---
type: ParameterSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ParameterSet

`Autodesk.Revit.DB.ParameterSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ParameterSet | — | `public ParameterSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( Parameter item )` |
| Method | Erase | — | `public virtual int Erase ( Parameter item )` |
| Method | ForwardIterator | — | `public virtual ParameterSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( Parameter item )` |
| Method | ReverseIterator | — | `public virtual ParameterSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |